src/Catalogs/кфкТипыДанныхСпецификации/кфкТипыДанныхСпецификации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>кфкТипыДанныхСпецификации</name>
  <hierarchical>true</hierarchical>
  <hierarchyType>HierarchyOfItems</hierarchyType>
  <owners>Catalog.кфкСпецификации</owners>
  <attributes>
    <name>Описание</name>
    <comment>description</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипДанных</name>
    <comment>type</comment>
    <type>
      <types>CatalogRef.кфкТипыЗначенийСпецификации</types>
    </type>
  </attributes>
  <attributes>
    <name>ФорматДанных</name>
    <comment>format</comment>
    <type>
      <types>CatalogRef.кфкТипыЗначенийСпецификации</types>
    </type>
  </attributes>
  <attributes>
    <name>Минимум</name>
    <comment>minimum|minLength|minItems</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>31</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Максимум</name>
    <comment>maximum|maxLength|maxItems</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>31</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Перечисление</name>
    <comment>enum</comment>
    <type>
      <types>CatalogRef.кфкПеречисленияСпецификации</types>
    </type>
  </attributes>
  <attributes>
    <name>РегулярноеВыражение</name>
    <comment>pattern</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Устарело</name>
    <comment>deprecated</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Обязательное</name>
    <comment>required</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗначениеПоУмолчанию</name>
    <comment>default</comment>
    <type>
      <types>Boolean</types>
      <types>String</types>
      <types>Date</types>
      <types>Number</types>
      <numberQualifiers>
        <precision>31</precision>
        <scale>4</scale>
      </numberQualifiers>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОбъектКонфигурации</name>
    <type>
      <types>CatalogRef.Свойства</types>
      <types>CatalogRef.Объекты</types>
    </type>
  </attributes>
  <tabularSections>
    <name>БазовыеТипы</name>
    <comment>$ref|allOf</comment>
    <attributes>
      <name>Тип</name>
      <type>
        <types>CatalogRef.кфкТипыДанныхСпецификации</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/Enums/ТипыОбъектов/ТипыОбъектов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="b00d3374-fba3-4dfd-a8b9-2e9192589501">
  <name>ТипыОбъектов</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues extendedConfigurationObject="9a8e9e82-d92a-4009-b106-ec0dad7bbfdc">
    <name>БизнесПроцесс</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="28f6293b-0a76-4f8d-b741-d6a86e461c95">
    <name>Булево</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="c96f080e-8e03-46df-92cf-899101180ccb">
    <name>Строка</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="52776854-ef3f-4d53-9b46-b1f5921f3db5">
    <name>Число</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="85dae71e-5343-4aa2-ad48-5bafd0e77bf1">
    <name>Дата</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="0ef44e26-9f8a-4f9f-af9f-b045c498816a">
    <name>ХранилищеЗначения</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="edc93a94-df17-4565-a085-b9635011d6e4">
    <name>УникальныйИдентификатор</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="3cc366d1-dec6-4c40-bc75-a26c1cc4d307">
    <name>Перечисление</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="e59131cc-796f-4a59-b508-b7116216ed5f">
    <name>ЛюбаяСсылка</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="61c264b5-4a1a-4a85-9134-71d05b5ef74f">
    <name>Справочник</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="f39eb3b4-764d-4e49-9149-79a08def2a0e">
    <name>Документ</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="b3b69793-028f-4701-963c-d2e5302d5e7b">
    <name>ПланВидовРасчета</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="3817b5d5-5de7-4f12-85c4-5037b01e683d">
    <name>ПланВидовХарактеристик</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="e46ff655-d737-4f7e-99a8-70bdd157c150">
    <name>ПланОбмена</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="556282ca-df4a-4d71-b417-48193ff98076">
    <name>ПланСчетов</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="666398bf-eff8-4172-9c11-f7e1a1382499">
    <name>ТочкаМаршрутаБизнесПроцесса</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="d4ec2030-fa42-4716-a9e9-87a282796ebb">
    <name>Задача</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="bf7d940d-ea2d-4e76-9a9b-17544835afee">
    <name>ВидРасчета</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="b65ce0b2-9d46-44a6-8beb-4b6114c07627">
    <name>ВидСубконто</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

src/Catalogs/Свойства/Свойства.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="f3707464-2a14-4985-bd92-b2906fe80703">
  <name>Свойства</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes extendedConfigurationObject="88e0934d-f5b7-4d3b-a324-4f6c5b80407c">
    <name>ТипыСтрокой</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="9e441ff9-cd6f-45c0-a5a8-d6cefa01a348">
    <name>Синоним</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="7f9fa1f0-0199-4658-9c43-8575de12ad99">
    <name>КвалификаторыСтроки_Длина</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="89d50220-35f5-4f73-8942-4760660dba77">
    <name>КвалификаторыЧисла_Точность</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="ea9570d1-cf27-4e71-b8a2-f1e06ae94a82">
    <name>КвалификаторыЧисла_Неотрицательное</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="4b991c56-77fb-49ae-8497-7fb5d6407663">
    <name>КвалификаторыДаты_Состав</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>12</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="cf3a7a6b-fc30-420a-81e1-04256ffec92a">
    <name>КвалификаторыЧисла_Длина</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="d4241a1f-7376-4978-a1eb-f250ed66f49d">
    <name>КвалификаторыСтроки_Фиксированная</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="7727b533-9762-4bdd-ae6f-c7bd22ad8be8">
    <name>Вид</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>кфкИмяEN</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>кфкПроверкаЗаполнения</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections extendedConfigurationObject="f50349b9-19fc-4f4a-8966-8a1aa8fc445c">
    <name>Типы</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="e3a1b3e7-3fea-4264-8c13-a0b13219e4b6">
      <name>Тип</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/Catalogs/кфкПеречисленияСпецификации/кфкПеречисленияСпецификации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>кфкПеречисленияСпецификации</name>
  <owners>Catalog.кфкСпецификации</owners>
  <attributes>
    <name>ТипЗначения</name>
    <type>
      <types>CatalogRef.кфкТипыЗначенийСпецификации</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбъектКонфигурации</name>
    <type>
      <types>CatalogRef.Объекты</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Значения</name>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
        <types>Number</types>
        <numberQualifiers>
          <precision>31</precision>
          <scale>4</scale>
        </numberQualifiers>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>120</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/Catalogs/кфкТипыЗначенийСпецификации/кфкТипыЗначенийСпецификации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>кфкТипыЗначенийСпецификации</name>
  <hierarchical>true</hierarchical>
  <predefined>
    <items>
      <name>Строка</name>
      <description>Строка</description>
    </items>
    <items>
      <name>Число</name>
      <description>Число</description>
    </items>
    <items>
      <name>ЦелоеЧисло</name>
      <description>Целое число</description>
    </items>
    <items>
      <name>Логический</name>
      <description>Логический</description>
    </items>
    <items>
      <name>Массив</name>
      <description>Массив</description>
    </items>
    <items>
      <name>Структура</name>
      <description>Структура</description>
    </items>
  </predefined>
</mdclass:Catalog>

src/Catalogs/кфкТипыДанныхСпецификации/Forms/ФормаПодбораПолей/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЗаполнитьДеревоСвойств();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыДерево

&НаКлиенте
Процедура ДеревоДобавитьПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Дерево.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ТекущиеДанные.Добавить = 2 Тогда
		ТекущиеДанные.Добавить = 0;
	КонецЕсли;

	УстановитьПометкиПодчиненных(ТекущиеДанные);
	УстановитьПометкиРодителей(ТекущиеДанные);

КонецПроцедуры

&НаКлиенте
Процедура ДеревоСвойствоПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Дерево.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Или ТекущиеДанные.ПолучитьЭлементы().Количество() > 0 Тогда
		Возврат;
	КонецЕсли;
	
	ТекущиеДанные.Добавить = 1;
	
	УстановитьПометкиРодителей(ТекущиеДанные);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ДобавитьСвойства(Команда)
	
	Результат = ДобавитьСвойстваНаСервере();
	Если Результат.Успешно Тогда
		Закрыть(Истина);
		
	Иначе
		ОбщегоНазначенияКлиент.СообщитьПользователю(Результат.ТекстОшибки);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура УстановитьПометкиПодчиненных(ТекущаяСтрока)
	
	Для Каждого Строка Из ТекущаяСтрока.ПолучитьЭлементы() Цикл
		Строка.Добавить = ТекущаяСтрока.Добавить;
		УстановитьПометкиПодчиненных(Строка);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьПометкиРодителей(ТекущаяСтрока)
	
	ТекущийРодитель = ТекущаяСтрока.ПолучитьРодителя();
	Если ТекущийРодитель = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	НайденыВключенные = Ложь;
	НайденыВыключенные = Ложь;
	
	Для Каждого Строка Из ТекущийРодитель.ПолучитьЭлементы() Цикл
		
		Если Строка.Добавить = 0 Тогда
			НайденыВыключенные = Истина;
			
		ИначеЕсли Строка.Добавить = 1 Или Строка.Добавить = 2 Тогда
			НайденыВключенные = Истина;
			
		КонецЕсли;
		
		Если НайденыВключенные И НайденыВыключенные Тогда
			Прервать;
		КонецЕсли;
		
	КонецЦикла;

	Если НайденыВключенные И НайденыВыключенные Тогда
		Включить = 2;
		
	ИначеЕсли НайденыВключенные И (Не НайденыВыключенные) Тогда
		Включить = 1;
		
	ИначеЕсли (Не НайденыВключенные) И НайденыВыключенные Тогда
		Включить = 0;
		
	ИначеЕсли (Не НайденыВключенные) И (Не НайденыВыключенные) Тогда
		Включить = 2;
		
	КонецЕсли;

	Если Включить = ТекущийРодитель.Добавить Тогда
		Возврат;
		
	Иначе
		ТекущийРодитель.Добавить = Включить;
		УстановитьПометкиРодителей(ТекущийРодитель);
		
	КонецЕсли;

КонецПроцедуры

&НаСервереБезКонтекста
Функция СвойстваОбъектаКонфигурации(ОбъектКонфигурации)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	Свойства.Ссылка КАК Ссылка,
	|	Свойства.Родитель КАК Родитель,
	|	Свойства.Наименование КАК Наименование,
	|	Свойства.Синоним КАК Синоним,
	|	Свойства.Вид КАК Вид,
	|	Свойства.КвалификаторыЧисла_Длина КАК КвалификаторыЧисла_Длина,
	|	Свойства.КвалификаторыЧисла_Точность КАК КвалификаторыЧисла_Точность,
	|	Свойства.КвалификаторыЧисла_Неотрицательное КАК КвалификаторыЧисла_Неотрицательное,
	|	Свойства.КвалификаторыСтроки_Длина КАК КвалификаторыСтроки_Длина,
	|	Свойства.КвалификаторыСтроки_Фиксированная КАК КвалификаторыСтроки_Фиксированная,
	|	Свойства.КвалификаторыДаты_Состав КАК КвалификаторыДаты_Состав,
	|	Свойства.ТипыСтрокой КАК ТипыСтрокой,
	|	СвойстваТипы.Тип КАК Тип,
	|	ВЫБОР
	|		КОГДА ТОбъекты.Тип В (&СсылочныеТипыОбъектов)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыОбъектов.УникальныйИдентификатор)
	|		ИНАЧЕ ТОбъекты.Тип
	|	КОНЕЦ КАК ТипТипа
	|ПОМЕСТИТЬ ВТВсеТипыСвойствОбъекта
	|ИЗ
	|	Справочник.Свойства КАК Свойства
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Свойства.Типы КАК СвойстваТипы
	|		ПО Свойства.Ссылка = СвойстваТипы.Ссылка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Объекты КАК ТОбъекты
	|		ПО СвойстваТипы.Тип = ТОбъекты.Ссылка
	|ГДЕ
	|	(Свойства.Владелец = &ОбъектКонфигурации
	|	ИЛИ Свойства.Родитель = &ОбъектКонфигурации)
	|	И Свойства.ЭтоГруппа = ЛОЖЬ
	|	И Свойства.ПометкаУдаления = ЛОЖЬ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Т.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ ВТСвойстваСоставногоТипа
	|ИЗ
	|	ВТВсеТипыСвойствОбъекта КАК Т
	|СГРУППИРОВАТЬ ПО
	|	Т.Ссылка
	|ИМЕЮЩИЕ
	|	КОЛИЧЕСТВО(*) > 1
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Т.Ссылка КАК Ссылка,
	|	Т.Родитель КАК Родитель,
	|	Т.Наименование КАК Наименование,
	|	Т.Синоним КАК Синоним,
	|	Т.КвалификаторыЧисла_Длина КАК КвалификаторыЧисла_Длина,
	|	Т.КвалификаторыЧисла_Точность КАК КвалификаторыЧисла_Точность,
	|	Т.КвалификаторыЧисла_Неотрицательное КАК КвалификаторыЧисла_Неотрицательное,
	|	Т.КвалификаторыСтроки_Длина КАК КвалификаторыСтроки_Длина,
	|	Т.КвалификаторыСтроки_Фиксированная КАК КвалификаторыСтроки_Фиксированная,
	|	Т.КвалификаторыДаты_Состав КАК КвалификаторыДаты_Состав,
	|	Т.ТипыСтрокой КАК ТипыСтрокой,
	|	Т.Тип КАК Тип,
	|	Т.ТипТипа КАК ТипТипа
	|ИЗ
	|	(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|		Т1.Ссылка КАК Ссылка,
	|		Т1.Родитель КАК Родитель,
	|		Т1.Наименование КАК Наименование,
	|		Т1.Синоним КАК Синоним,
	|		Т1.Вид КАК Вид,
	|		Т1.КвалификаторыЧисла_Длина КАК КвалификаторыЧисла_Длина,
	|		Т1.КвалификаторыЧисла_Точность КАК КвалификаторыЧисла_Точность,
	|		Т1.КвалификаторыЧисла_Неотрицательное КАК КвалификаторыЧисла_Неотрицательное,
	|		Т1.КвалификаторыСтроки_Длина КАК КвалификаторыСтроки_Длина,
	|		Т1.КвалификаторыСтроки_Фиксированная КАК КвалификаторыСтроки_Фиксированная,
	|		Т1.КвалификаторыДаты_Состав КАК КвалификаторыДаты_Состав,
	|		ВЫРАЗИТЬ(Т1.ТипыСтрокой КАК СТРОКА(1000)) КАК ТипыСтрокой,
	|		ВЫБОР
	|			КОГДА Т2.Ссылка ЕСТЬ NULL
	|				ТОГДА Т1.ТипТипа
	|		КОНЕЦ КАК ТипТипа,
	|		ВЫБОР
	|			КОГДА Т2.Ссылка ЕСТЬ NULL
	|			И Т3.Ссылка ЕСТЬ NULL
	|				ТОГДА Т1.Тип
	|		КОНЕЦ КАК Тип
	|	ИЗ
	|		ВТВсеТипыСвойствОбъекта КАК Т1
	|			ЛЕВОЕ СОЕДИНЕНИЕ ВТСвойстваСоставногоТипа КАК Т2
	|			ПО Т1.Ссылка = Т2.Ссылка
	|			ЛЕВОЕ СОЕДИНЕНИЕ ВТВсеТипыСвойствОбъекта КАК Т3
	|			ПО Т1.Ссылка = Т3.Ссылка
	|			И Т1.ТипТипа = Т3.ТипТипа
	|			И Т1.Тип <> Т3.Тип) КАК Т
	|
	|УПОРЯДОЧИТЬ ПО
	|	ВЫБОР
	|		КОГДА Т.Вид = ЗНАЧЕНИЕ(Перечисление.ВидыСвойств.ТабличнаяЧасть)
	|			ТОГДА 4
	|		КОГДА Т.Вид = ЗНАЧЕНИЕ(Перечисление.ВидыСвойств.Реквизит)
	|			ТОГДА 3
	|		КОГДА Т.Вид = ЗНАЧЕНИЕ(Перечисление.ВидыСвойств.Свойство)
	|			ТОГДА 1
	|		ИНАЧЕ 2
	|	КОНЕЦ,
	|	Т.Наименование
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Свойства.Ссылка КАК Ссылка,
	|	Свойства.Наименование КАК Наименование,
	|	Свойства.Синоним КАК Синоним
	|ИЗ
	|	Справочник.Свойства КАК Свойства
	|ГДЕ
	|	Свойства.Владелец = &ОбъектКонфигурации
	|	И Свойства.Родитель = ЗНАЧЕНИЕ(Справочник.Свойства.ПустаяСсылка)
	|	И Свойства.ЭтоГруппа = ИСТИНА
	|	И Свойства.ПометкаУдаления = ЛОЖЬ
	|
	|УПОРЯДОЧИТЬ ПО
	|	Свойства.Наименование";
	Запрос.УстановитьПараметр("ОбъектКонфигурации", ОбъектКонфигурации);
	Запрос.УстановитьПараметр("СсылочныеТипыОбъектов", СсылочныеТипыОбъектов());
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	
	Реквизиты = Неопределено;
	ТабЧасти = Неопределено;
	Если ТипЗнч(ОбъектКонфигурации) = Тип("СправочникСсылка.Объекты") Тогда
		// реквизиты объекта и табличные части 
		ВсеРеквизиты = РезультатЗапроса[РезультатЗапроса.ВГраница()-1].Выгрузить(); // ТаблицаЗначений
		ВсеРеквизиты.Индексы.Добавить("Родитель");
		
		// Реквизиты объекта
		Реквизиты = ВсеРеквизиты.Скопировать(Новый Структура("Родитель", Справочники.Свойства.ПустаяСсылка()));
		//@skip-check bsl-legacy-check-expression-type
		Реквизиты.Колонки.Удалить("Родитель");
		
		// Табличные части
		ТабЧасти = РезультатЗапроса[РезультатЗапроса.ВГраница()].Выгрузить();
		ТабЧасти.Колонки.Добавить("Реквизиты", Новый ОписаниеТипов("ТаблицаЗначений"));
		// Реквизиты табличных частей
		
		// Добавим сразу реквизиты табличных частей в табличные части 
		Для Каждого ТЧ Из ТабЧасти Цикл
			ТЧ.Реквизиты = ВсеРеквизиты.Скопировать(Новый Структура("Родитель", ТЧ.Ссылка));
			ТЧ.Реквизиты.Колонки.Удалить("Родитель");
		КонецЦикла;
		
	ИначеЕсли ТипЗнч(ОбъектКонфигурации) = Тип("СправочникСсылка.Свойства") Тогда
		// реквизиты табличной части 
		Реквизиты = РезультатЗапроса[РезультатЗапроса.ВГраница()-1].Выгрузить(); // ТаблицаЗначений
		//@skip-check bsl-legacy-check-expression-type
		Реквизиты.Колонки.Удалить("Родитель");
		ТабЧасти = Новый Массив;
		
	Иначе
		ВызватьИсключение СтрШаблон(НСтр("ru = 'Неизвестный тип объекта конфигурации: %1'"), ОбъектКонфигурации);
	КонецЕсли;
	
	//@skip-check constructor-function-return-section
	Возврат Новый Структура("Реквизиты, ТабличныеЧасти", Реквизиты, ТабЧасти);
	
КонецФункции

&НаСервереБезКонтекста
Функция ПеречисленияСпецификации(Спецификация)
	
	Результат = Новый Соответствие;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ Справочник.кфкПеречисленияСпецификации.Ссылка, ОбъектКонфигурации
	|ГДЕ Владелец = &Спецификация И ПометкаУдаления = ЛОЖЬ И ОбъектКонфигурации <> ЗНАЧЕНИЕ(Справочник.Объекты.ПустаяСсылка)";
	Запрос.УстановитьПараметр("Спецификация", Спецификация);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Результат.Вставить(Выборка.ОбъектКонфигурации, Выборка.Ссылка);
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

&НаСервереБезКонтекста
Функция НавигацияПоКолонке(Дерево, ИмяКолонки, Приемник = Неопределено)
	
	Если Приемник = Неопределено Тогда
		Приемник = Новый Соответствие;
	КонецЕсли;
	
	Для Каждого СтрокаДерева Из Дерево.Строки Цикл
		
		Значение = СтрокаДерева[ИмяКолонки];
		Если ЗначениеЗаполнено(Значение) Тогда
			Приемник.Вставить(Значение, СтрокаДерева);
		КонецЕсли;
		
		НавигацияПоКолонке(СтрокаДерева, ИмяКолонки, Приемник);
		
	КонецЦикла;
	
	Возврат Приемник;
	
КонецФункции

&НаСервереБезКонтекста
Функция СсылочныеТипыОбъектов()
	
	Результат = Новый Массив;
	Результат.Добавить(Перечисления.ТипыОбъектов.ЛюбаяСсылка);
	Результат.Добавить(Перечисления.ТипыОбъектов.Справочник);
	Результат.Добавить(Перечисления.ТипыОбъектов.Документ);
	Результат.Добавить(Перечисления.ТипыОбъектов.ПланВидовХарактеристик);
	Результат.Добавить(Перечисления.ТипыОбъектов.ПланСчетов);
	Результат.Добавить(Перечисления.ТипыОбъектов.ПланВидовРасчета);
	Результат.Добавить(Перечисления.ТипыОбъектов.ПланОбмена);
	Результат.Добавить(Перечисления.ТипыОбъектов.БизнесПроцесс);
	Результат.Добавить(Перечисления.ТипыОбъектов.Задача);
	Результат.Добавить(Перечисления.ТипыОбъектов.ТочкаМаршрутаБизнесПроцесса);
	Результат.Добавить(Перечисления.ТипыОбъектов.ВидРасчета);
	Результат.Добавить(Перечисления.ТипыОбъектов.ВидСубконто);
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Процедура ЗаполнитьДеревоСвойств()
	
	Строки = Дерево.ПолучитьЭлементы();
	Строки.Очистить();
	
	Свойства = СвойстваОбъектаКонфигурации(Параметры.ОбъектКонфигурации);
	Реквизиты = Свойства.Реквизиты; // ТаблицаЗначений
	ТабЧасти = Свойства.ТабличныеЧасти; // ТаблицаЗначений
	
	ПеречисленияСпецификации = ПеречисленияСпецификации(Параметры.Спецификация);
	
	ЭлементыТипаДанных = Справочники.кфкТипыДанныхСпецификации.ПодчинныеЭлементы(Параметры.ТипДанных);
	СвойстваТипаДанных = НавигацияПоКолонке(ЭлементыТипаДанных, "ОбъектКонфигурации");
	
	// Реквизиты объекта конфигурации
	Для Каждого Реквизит Из Реквизиты Цикл
		ДобавитьСвойствоВДерево(Строки, Реквизит, СвойстваТипаДанных, ПеречисленияСпецификации);
	КонецЦикла;
	
	// Табличные части объекта конфигурации
	Для Каждого ТабЧасть Из ТабЧасти Цикл
		
		// Если табличная часть уже есть в спецификации, то выводим только те реквизиты, которые еще не добавлены в спецификацию.
		// Если табличная часть не добавлена в спецификацию, то выводим все реквизиты
		Свойство = СвойстваТипаДанных.Получить(ТабЧасть.Ссылка);
		Если Свойство <> Неопределено Тогда
			ТребуетсяВывести = Ложь;
			Для Каждого Реквизит Из ТабЧасть.Реквизиты Цикл
				Если СвойстваТипаДанных.Получить(Реквизит.Ссылка) = Неопределено Тогда
					ТребуетсяВывести = Истина;
				КонецЕсли;
			КонецЦикла;
			Если Не ТребуетсяВывести Тогда
				Продолжить;
			КонецЕсли;
		КонецЕсли;
		
		НоваяСтрока = Строки.Добавить();
		НоваяСтрока.СвойствоКонфигурации = ТабЧасть.Ссылка;
		НоваяСтрока.Свойство = ?(Свойство = Неопределено, Неопределено, Свойство.Код);
		НоваяСтрока.ТипДанных = Справочники.кфкТипыЗначенийСпецификации.Массив;
		НоваяСтрока.Ссылка = ?(Свойство = Неопределено, Неопределено, Свойство.Ссылка);
		
		СтрокиТЧ = НоваяСтрока.ПолучитьЭлементы();
		
		// Реквизиты табличной части
		Для Каждого Реквизит Из ТабЧасть.Реквизиты Цикл	
			ДобавитьСвойствоВДерево(СтрокиТЧ, Реквизит, СвойстваТипаДанных, ПеречисленияСпецификации);
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьСвойствоВДерево(Строки, Реквизит, СвойстваТипаДанных, ПеречисленияСпецификации)
	
	Свойство = СвойстваТипаДанных.Получить(Реквизит.Ссылка);
	Если Свойство <> Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	НоваяСтрока = Строки.Добавить();
	НоваяСтрока.СвойствоКонфигурации = Реквизит.Ссылка;
	НоваяСтрока.СвойствоКонфигурацииНаименование = Реквизит.Наименование;
	НоваяСтрока.СвойствоКонфигурацииСиноним = Реквизит.Синоним;
	НоваяСтрока.ТипСвойстваКонфигурации = Реквизит.ТипыСтрокой;
	НоваяСтрока.Тип = Реквизит.Тип;
	НоваяСтрока.ТипТипа = Реквизит.ТипТипа;
	НоваяСтрока.Свойство = ?(Свойство = Неопределено, Неопределено, Свойство.Код); // Неопределено -> Наименование+Синоним
	НоваяСтрока.ТипДанных = Неопределено;
	НоваяСтрока.ФорматДанных = Неопределено;
	НоваяСтрока.Перечисление = Неопределено;
	НоваяСтрока.Минимум = Неопределено;
	НоваяСтрока.Максимум = Неопределено;
	НоваяСтрока.Ссылка = ?(Свойство = Неопределено, Неопределено, Свойство.Ссылка);
	
	ТипыЗначений = Справочники.кфкТипыЗначенийСпецификации;
	Если Реквизит.ТипТипа = Перечисления.ТипыОбъектов.Строка Тогда
		НоваяСтрока.ТипДанных = ТипыЗначений.Строка;
		НоваяСтрока.Максимум = ?(Реквизит.КвалификаторыСтроки_Длина = 0, Неопределено, Реквизит.КвалификаторыСтроки_Длина);
		
	ИначеЕсли Реквизит.ТипТипа = Перечисления.ТипыОбъектов.Число Тогда
		Если Реквизит.КвалификаторыЧисла_Точность = 0 Тогда
			НоваяСтрока.ТипДанных = ТипыЗначений.ЦелоеЧисло;
			НоваяСтрока.ФорматДанных = ?(Реквизит.КвалификаторыЧисла_Длина <= 9,
				ТипыЗначений.ЦелоеЧисло32, ТипыЗначений.ЦелоеЧисло64);
			
		Иначе
			НоваяСтрока.ТипДанных = ТипыЗначений.Число;
			НоваяСтрока.ФорматДанных = ?(Реквизит.КвалификаторыЧисла_Длина <= 7,
				ТипыЗначений.ДробноеЧисло, ТипыЗначений.ДробноеДвойнойТочности);
			
		КонецЕсли;
		
	ИначеЕсли Реквизит.ТипТипа = Перечисления.ТипыОбъектов.Булево Тогда
		НоваяСтрока.ТипДанных = ТипыЗначений.Логический;
		
	ИначеЕсли Реквизит.ТипТипа = Перечисления.ТипыОбъектов.Дата Тогда
		НоваяСтрока.ТипДанных = ТипыЗначений.Строка;
		Состав = НРег(СокрЛП(Реквизит.КвалификаторыДаты_Состав));
		Если Состав = "дата" Тогда
			НоваяСтрока.ФорматДанных = ТипыЗначений.Дата;
			
		ИначеЕсли Состав = "время" Тогда
			НоваяСтрока.ФорматДанных = ТипыЗначений.Время;
			
		Иначе
			НоваяСтрока.ФорматДанных = ТипыЗначений.ДатаВремя;
			
		КонецЕсли;
		
	ИначеЕсли Реквизит.ТипТипа = Перечисления.ТипыОбъектов.ХранилищеЗначения Тогда
		НоваяСтрока.ТипДанных = ТипыЗначений.Строка;
		НоваяСтрока.ФорматДанных = ТипыЗначений.ДанныеBase64;
		
	ИначеЕсли Реквизит.ТипТипа = Перечисления.ТипыОбъектов.УникальныйИдентификатор Тогда
		НоваяСтрока.ТипДанных = ТипыЗначений.Строка;
		НоваяСтрока.ФорматДанных = ТипыЗначений.УникальныйИдентификатор;
		
	ИначеЕсли Реквизит.ТипТипа = Перечисления.ТипыОбъектов.Перечисление Тогда
		НоваяСтрока.ТипДанных = ТипыЗначений.Строка;
		НоваяСтрока.Перечисление = ?(ЗначениеЗаполнено(Реквизит.Тип),
			ПеречисленияСпецификации.Получить(Реквизит.Тип), Неопределено);
		
	Иначе
		НоваяСтрока.ТипДанных = ТипыЗначений.Строка;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ДобавитьСвойстваНаСервере()
	
	ДеревоСвойств = РеквизитФормыВЗначение("Дерево");
	Возврат Справочники.кфкТипыДанныхСпецификации.СоздатьСвойства(
		Параметры.Спецификация, Параметры.ТипДанных, ДеревоСвойств);
	
КонецФункции

#КонецОбласти
